==================
integer array
==================
[1,2,3,4];

---
(source_file 
      (collection 
        (literal 
          (number 
            (integer )))
        (literal 
          (number 
            (integer )))
        (literal 
          (number 
            (integer )))
        (literal 
          (number 
            (integer ))))
    )

==================
Associative array
==================
[\a -> 1, \b -> \symmysymmyya, \c -> 3.81];

---
(source_file 
      (collection 
        (associative_item 
          (symbol 
            (identifier ))
          (item 
            (literal 
              (number 
                (integer )))))
        (associative_item 
          (symbol 
            (identifier ))
          (item 
            (literal 
              (symbol 
                (identifier )))))
        (associative_item 
          (symbol 
            (identifier ))
          (item 
            (literal 
              (number 
                (float ))))))
    )


==================
Assign array to variable
==================
var array = [1,2,3,4];

---
(source_file 
  (variable_definition 
    (variable 
      (local_var 
        (identifier )))
    (collection 
      (literal 
        (number 
          (integer )))
      (literal 
        (number 
          (integer )))
      (literal 
        (number 
          (integer )))
      (literal 
        (number 
          (integer )))
      )))

==================
Simple event
==================
var event = (freq: 441.0, dur: 1.0);

---
(source_file 
  (variable_definition 
    (variable 
      (local_var 
        (identifier )))
    (collection 
      (associative_item 
        (identifier )
        (item 
          (literal 
            (number 
              (float )))))
      (associative_item 
        (identifier )
        (item 
          (literal 
            (number 
              (float ))))))))

==================
collection with type prefixed
==================
Bag[1,2,3];

---
(source_file 
  (collection 
    (collection_type )
    (literal 
      (number 
        (integer )))
    (literal 
      (number 
        (integer )))
    (literal 
      (number 
        (integer)))))

==================
collection with type prefixed in variable declaration
==================

a = Set[1, 2, 3];
---
(source_file 
  (variable_definition 
    (variable 
      (environment_var ))
    (collection 
      (collection_type )
      (literal 
        (number 
          (integer )))
      (literal 
        (number 
          (integer )))
      (literal 
        (number 
          (integer ))))))
